import discord
bot = discord.Bot()

resources = { # Список всех ресурсов
    'gems': "<:gems:990318941819768892>",
    'iron': "<:iron:987380754810040370>",
    'wood': "<:wood1:987380748807966751>",
    'organic': "<:organic:987380756445794354>",
    'details': "<:details:987380753266520194>",
    'batteries': "<:batteries:987380746589208676>",
    'shards': "<:shards:987380760212291644>"
} 

Ogr_post = {
    'Безработный': None,
    'Шахта': [
                {"Шахтер": "100"},
                {"Старший шахтер": "200"},
                {"Прораб": "300"},
                {"Руководитель шахтерской отрасли": "400"},
                {"Директор рудников (Железные горы)": None},
    ],
    'Лесопилка': [
                {"Топоруб": "100"},
                {"Дровосек": "100"},
                {"Смотрящий лесопилки": "100"},
                {"Руководитель Лесоповалом": "100"},
                {"Древесный магнат": None},
    ],    
    'Органический сад': [
                {"Поливатель": "100"},
                {"Фермер": "100"},
                {"Считающий растительность": "100"},
                {"Следящий за фермой": "100"},
                {"Хозяин долины": None},
    ],
    'Завод': [
                {"Жестянщик": "100"},
                {"Слесарь": "100"},
                {"Мастер кузнецов": "100"},
                {"Начальник цеха": "100"},
                {"Распорядитель завода": None},
    ],  
    'Электростанция': [
                {"Изготовитель батарей": "100"},
                {"Оператор станции": "100"},
                {"Инженер": "100"},
                {"Управляющий Энерго станцией": "100"},
                {"Председатель электростанции": None},
    ],
    'Лаборатрия 903': [
                {"Стажер": "100"},
                {"Ученый": "100"},
                {"Сотрудник отдела 901-А": "100"},
                {"Директор Лаборатории": "100"},
                {"Объект A901JT": None},
    ],          
}

Role = "Шахта" 
rang = "Шахтер"
rangs = Ogr_post[Role]
index = 0 

index = 0
for i in rangs:
    if list(i) == [rang]:
        break
    index += 1

x = rangs[index][rang]

print(x)

# Role = "Шахта" # На повышение
# Roles = Ogr_post.get(Role)
# index = 0 

# for i in Roles:
#     if list(i) == [Role]:
#         break
#     index += 1

# NewRole = ''.join(Roles[index + 1])

# print(NewRole)
